Services/logs/tbknullify_comunication.log

[2017-06-29 01:09:25] 1111 - nullify - REQUEST:
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:nullify><nullificationInput><commerceId>597020000541</commerceId><buyOrder>1111</buyOrder><authorizedAmount>1990</authorizedAmount><authorizationCode>1213</authorizationCode><nullifyAmount>1000</nullifyAmount></nullificationInput></ns1:nullify></SOAP-ENV:Body></SOAP-ENV:Envelope>

[2017-06-29 01:09:25] 1111 - nullify - RESPONSE:
<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-2670"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-2669"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>7ou+cGbBslZpIucY0ui6YswiNBY=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>N+AJTnp8B2Fb2ZSp1OA8ixH6iOwy5ZsOcE6UqGuNp8E+2rIzYM77GiiduqkWpLxsoS07pFxsIhXK
2XQIjj7KOCcNOrULpLY2eHXouE3L6bvgzOhDXWLksc29GijSlsSakzQnTxtLk+/YkntD0T2nGzfv
xVYgTkf50hg72BNyiamqT3Wc0ELWtBrO4JQXrmLl+sNy7l2NPQpxWwyLFT3+CKL/O9oVXSNaEz/c
R1tbHH6kbMnEyr8dzYJP+SBiAq0Wp9i+vysKUadglGQiMIcSQ1mh6pa0e1Z0MEnZ0GiC4EMzvRZw
xMIuutGfAF2sjvB8MST1q3NxxT57/oVY+vj88w==</ds:SignatureValue><ds:KeyInfo Id="KI-7DF136BBB9F24278A114986985650984004"><wsse:SecurityTokenReference wsu:Id="STR-7DF136BBB9F24278A114986985650984005"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2669"><ns2:nullifyResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><authorizationCode>121065</authorizationCode><authorizationDate>2017-06-28T21:09:25.015-04:00</authorizationDate><balance>990</balance><nullifiedAmount>1000</nullifiedAmount><token>94a486c09b35dafb13242b927f101bc12b095ad7b0566241bc9196fa04caf06b</token></return></ns2:nullifyResponse></soap:Body></soap:Envelope>

